In [ ]:
#Programs to handle data using pandas.

**Series**

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
#To convert numpy array into series
ls=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [ ]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(data=my_list,index=ls)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(arr,ls)

a    10
b    20
c    30
dtype: int64

In [ ]:
ser1=pd.Series((3,2,7,1),index=['A','B','C','D'])

In [ ]:
ser2=pd.Series((5,6,7,8),index=['A','B','E','F'])

In [ ]:
ser1+ser2

A    8.0
B    8.0
C    NaN
D    NaN
E    NaN
F    NaN
dtype: float64

**DataFrames**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
from numpy.random import randn
np.random.seed(101)

In [ ]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [ ]:
df[['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [ ]:
#Creating new column
df['new']=df['W']+df['X']

In [ ]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [ ]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [ ]:
#Delete permanantly use inplace=True
df.drop('new',axis=1,inplace=True)

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [ ]:
#Selecting Rows
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [ ]:
#Select a row using index
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [ ]:
df.loc['C','X']

0.7401220570561068

In [ ]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

**Conditional Selection**

In [ ]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [ ]:
df[df['W']>0][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [ ]:
df[(df['W']>0)&(df['Z']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

**Missing data**

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df=pd.DataFrame({'A':[1,2,np.nan],
                'B':[5,np.nan,np.nan],
                'C':[1,2,3]})

In [ ]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [ ]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [ ]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [ ]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [ ]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [ ]:
df['A'].unique()

array([ 1.,  2., nan])

In [ ]:
df['B'].nunique()

1

In [ ]:
df['A'].value_counts()

2.0    1
1.0    1
Name: A, dtype: int64

**Selecting Data**

In [ ]:
#Selecting data
newdf=df[(df['A']>1)& (df['B']==5.0)]

In [ ]:
newdf

Empty DataFrame
Columns: [A, B, C]
Index: []

In [ ]:
def time2(x):
  return x*2

**Applying Functions**

In [ ]:
df['A'].apply(time2)

0    2.0
1    4.0
2    NaN
Name: A, dtype: float64

In [ ]:
df=pd.DataFrame({'A':[1,2,3],
                'B':[5,'ABC','DEF'],
                'C':[6,3,10]})

In [ ]:
df

   A    B   C
0  1    5   6
1  2  ABC   3
2  3  DEF  10

In [ ]:
df['A'].sum()

6

**Permanantly removing column**

In [ ]:
del df['C']

In [ ]:
df

   A    B
0  1    5
1  2  ABC
2  3  DEF

**Get columns**

In [ ]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=3, step=1)

**Sorting and ordering dataframe**

In [ ]:
df.sort_values(by='C')#inplace=False by default

   A    B   C
1  2  ABC   3
0  1    5   6
2  3  DEF  10

In [ ]:
df.sort_values(by='C',inplace=True)

In [ ]:
df

   A    B   C
1  2  ABC   3
0  1    5   6
2  3  DEF  10

In [ ]:
df.isnull()

       A      B      C
1  False  False  False
0  False  False  False
2  False  False  False